tylertms/kinetis-k22-sim/tests/device/kinetis/platform/host_api_test.c
static void test_io_api(TestState* state, Kinetis* device) {
    k22_io_set_clock(&device->io, K22_PERIPHERAL_USB0, true);
    io_write(state, device, USB0 + 0x84u, 1u, 1u << 3u);
    io_write(state, device, USB0 + 0x94u, 1u, 1u);
    expect(state, kinetis_usb_token(device, 3u, 0x69u, false),
           "kinetis_usb_token(device, 3u, 0x69u, false)");
    expect(state, !kinetis_usb_token(NULL, 0u, 0u, false),
           "!kinetis_usb_token(NULL, 0u, 0u, false)");

    k22_io_set_clock(&device->io, K22_PERIPHERAL_CAN0, true);
    io_write(state, device, CAN0, 4u, 0x0fu);
    io_write(state, device, CAN0 + 0x10u, 4u, 0u);
    io_write(state, device, CAN0 + 0x28u, 4u, 1u);
    io_write(state, device, CAN0 + 0x80u, 4u, 4u << 24u);
    KinetisCanFrame can_frame = {0x123u, 2u, {1u, 2u}, false, false};
    expect(state, kinetis_can_receive(device, &can_frame),
           "kinetis_can_receive(device, &can_frame)");
    expect(state, !kinetis_can_receive(device, NULL), "!kinetis_can_receive(device, NULL)");
    expect(state, !kinetis_can_receive(NULL, &can_frame), "!kinetis_can_receive(NULL, &can_frame)");

    k22_io_set_clock(&device->io, K22_PERIPHERAL_I2S0, true);
    io_write(state, device, I2S0, 4u, UINT32_C(0x80000000));
    io_write(state, device, I2S0 + 0x80u, 4u, UINT32_C(0x80000000));
    io_write(state, device, I2S0 + 0x20u, 4u, 0x11223344u);
    uint32_t i2s_sample = 0u;
    expect(state, kinetis_i2s_transmit(device, &i2s_sample),
           "kinetis_i2s_transmit(device, &i2s_sample)");
    expect(state, i2s_sample == 0x11223344u, "i2s_sample == 0x11223344u");
    expect(state, kinetis_i2s_receive(device, 0x55667788u),
           "kinetis_i2s_receive(device, 0x55667788u)");
    expect(state, !kinetis_i2s_transmit(NULL, &i2s_sample),
           "!kinetis_i2s_transmit(NULL, &i2s_sample)");
    expect(state, !kinetis_i2s_receive(NULL, 0u), "!kinetis_i2s_receive(NULL, 0u)");

    bool gpio_high = false;
    expect(state, kinetis_gpio_drive(device, 0u, 1u, true),
           "kinetis_gpio_drive(device, 0u, 1u, true)");
    expect(state, kinetis_gpio_pin(device, 0u, 1u, &gpio_high) && gpio_high,
           "kinetis_gpio_pin(device, 0u, 1u, &gpio_high) && gpio_high");
    expect(state, kinetis_gpio_release(device, 0u, 1u), "kinetis_gpio_release(device, 0u, 1u)");
    expect(state, !kinetis_gpio_pin(NULL, 0u, 1u, &gpio_high),
           "!kinetis_gpio_pin(NULL, 0u, 1u, &gpio_high)");
    expect(state, !kinetis_gpio_pin(device, 0u, 1u, NULL),
           "!kinetis_gpio_pin(device, 0u, 1u, NULL)");
    expect(state, !kinetis_gpio_pin(device, UINT8_MAX, 0u, &gpio_high),
           "!kinetis_gpio_pin(device, UINT8_MAX, 0u, &gpio_high)");
    expect(state, !kinetis_gpio_drive(NULL, 0u, 0u, false),
           "!kinetis_gpio_drive(NULL, 0u, 0u, false)");
    expect(state, !kinetis_gpio_release(NULL, 0u, 0u), "!kinetis_gpio_release(NULL, 0u, 0u)");
}

static void test_mkv30_package_and_channels(TestState* state) {
    KinetisConfiguration configuration = kinetis_configuration(KINETIS_PROFILE_MKV30F12810);
    configuration.package = KINETIS_PACKAGE_FM_32_QFN;
    Kinetis* device = kinetis_create(configuration);
    expect(state, device != NULL, "MKV30 host API device is created");
    bool output = false;
    expect(state, kinetis_set_ftm_input(device, 0u, 5u, true), "MKV30 FTM0 channel 5 exists");
    expect(state, !kinetis_set_ftm_input(device, 0u, 6u, true),
           "MKV30 FTM0 channel 6 does not exist");
    expect(state, !kinetis_get_ftm_output(device, 0u, 7u, &output),
           "MKV30 FTM0 channel 7 does not exist");
    uint32_t vref_value = 0u;
    expect(state,
           !kinetis_peripheral_read(device, 0x40074000u, 1u, CORTEX_M4_ACCESS_DEBUG, &vref_value),
           "MKV30 FM32 package has no VREF peripheral");
    kinetis_destroy(device);
}

static void test_guards(TestState* state, Kinetis* device) {
    uint32_t guard_value = 0u;
    const uint8_t guard_memory[] = {1u, 2u, 3u, 4u};
    expect(state, !kinetis_reset(NULL), "!kinetis_reset(NULL)");
    expect(state, !kinetis_load(NULL, 0u, guard_memory, sizeof(guard_memory)),
           "!kinetis_load(NULL, 0u, guard_memory, sizeof(guard_memory))");
    expect(state, !kinetis_load(device, 0u, NULL, sizeof(guard_memory)),
           "!kinetis_load(device, 0u, NULL, sizeof(guard_memory))");
    expect(state, !kinetis_load(device, UINT32_MAX, guard_memory, sizeof(guard_memory)),
           "!kinetis_load(device, UINT32_MAX, guard_memory, sizeof(guard_memory))");
    expect(state, !kinetis_read(NULL, 0u, &guard_value, sizeof(guard_value)),
           "!kinetis_read(NULL, 0u, &guard_value, sizeof(guard_value))");
    expect(state, !kinetis_read(device, 0u, NULL, sizeof(guard_value)),
           "!kinetis_read(device, 0u, NULL, sizeof(guard_value))");
    expect(state, !kinetis_write(NULL, 0u, &guard_value, sizeof(guard_value)),
           "!kinetis_write(NULL, 0u, &guard_value, sizeof(guard_value))");
    expect(state, !kinetis_write(device, 0u, NULL, sizeof(guard_value)),
           "!kinetis_write(device, 0u, NULL, sizeof(guard_value))");
    expect(state, !kinetis_copy(NULL, device), "!kinetis_copy(NULL, device)");
    expect(state, !kinetis_copy(device, NULL), "!kinetis_copy(device, NULL)");
    expect(state, !kinetis_memory_read(NULL, 0u, 4u, CORTEX_M4_ACCESS_DEBUG, &guard_value),
           "!kinetis_memory_read(NULL, 0u, 4u, CORTEX_M4_ACCESS_DEBUG, &guard_value)");
    expect(state, !kinetis_memory_read(device, 0u, 4u, CORTEX_M4_ACCESS_DEBUG, NULL),
           "!kinetis_memory_read(device, 0u, 4u, CORTEX_M4_ACCESS_DEBUG, NULL)");
    expect(state, !kinetis_memory_read(device, 0u, 3u, CORTEX_M4_ACCESS_DEBUG, &guard_value),
           "!kinetis_memory_read(device, 0u, 3u, CORTEX_M4_ACCESS_DEBUG, &guard_value)");
    expect(state, !kinetis_memory_write(NULL, 0u, 4u, CORTEX_M4_ACCESS_DEBUG, guard_value),
           "!kinetis_memory_write(NULL, 0u, 4u, CORTEX_M4_ACCESS_DEBUG, guard_value)");
    expect(state, !kinetis_memory_write(device, 0u, 3u, CORTEX_M4_ACCESS_DEBUG, guard_value),
           "!kinetis_memory_write(device, 0u, 3u, CORTEX_M4_ACCESS_DEBUG, guard_value)");
    expect(state, !kinetis_flash_controller_write(NULL, 0u, 4u, guard_value),
           "!kinetis_flash_controller_write(NULL, 0u, 4u, guard_value)");
    expect(state, !kinetis_flash_controller_write(device, UINT32_MAX, 4u, guard_value),
           "!kinetis_flash_controller_write(device, UINT32_MAX, 4u, guard_value)");
    expect(state, !kinetis_flexbus_attach(NULL, 0u, guard_memory, sizeof(guard_memory), false),
           "!kinetis_flexbus_attach(NULL, 0u, guard_memory, sizeof(guard_memory), false)");
    expect(state, !kinetis_flexbus_attach(device, 0u, NULL, sizeof(guard_memory), false),
           "!kinetis_flexbus_attach(device, 0u, NULL, sizeof(guard_memory), false)");
    expect(state, !kinetis_flexbus_attach(device, 0u, guard_memory, 0u, false),
           "!kinetis_flexbus_attach(device, 0u, guard_memory, 0u, false)");
    expect(state,
           !kinetis_flexbus_attach(device, UINT32_MAX, guard_memory, sizeof(guard_memory), false),
           "!kinetis_flexbus_attach(device, UINT32_MAX, guard_memory, sizeof(guard_memory), "
           "false)");
    kinetis_flexbus_detach(NULL);
    expect(state, !kinetis_flexbus_read(NULL, 0u, &guard_value, sizeof(guard_value)),
           "!kinetis_flexbus_read(NULL, 0u, &guard_value, sizeof(guard_value))");
    expect(state, !kinetis_flexbus_read(device, 0u, NULL, sizeof(guard_value)),
           "!kinetis_flexbus_read(device, 0u, NULL, sizeof(guard_value))");
    expect(state, !kinetis_flexbus_read(device, 0u, &guard_value, sizeof(guard_value)),
           "!kinetis_flexbus_read(device, 0u, &guard_value, sizeof(guard_value))");
    expect(state, kinetis_set_usb_charger(device, KINETIS_USB_CHARGER_NONE),
           "kinetis_set_usb_charger(device, KINETIS_USB_CHARGER_NONE)");
    expect(state, kinetis_set_usb_charger(device, KINETIS_USB_CHARGER_ERROR),
           "kinetis_set_usb_charger(device, KINETIS_USB_CHARGER_ERROR)");
    expect(state, !kinetis_set_usb_charger(device, (KinetisUsbCharger)UINT8_MAX),
           "!kinetis_set_usb_charger(device, (KinetisUsbCharger)UINT8_MAX)");
    expect(state, !kinetis_set_usb_charger(NULL, KINETIS_USB_CHARGER_NONE),
           "!kinetis_set_usb_charger(NULL, KINETIS_USB_CHARGER_NONE)");
    expect(state, kinetis_set_usb_pullup(device, true), "kinetis_set_usb_pullup(device, true)");
    expect(state, kinetis_set_usb_pullup(device, false), "kinetis_set_usb_pullup(device, false)");
    expect(state, !kinetis_set_usb_pullup(NULL, true), "!kinetis_set_usb_pullup(NULL, true)");
    KinetisEvent event;
    while (kinetis_next_event(device, &event)) {
    }
    expect(state, !kinetis_next_event(device, &event), "!kinetis_next_event(device, &event)");
    expect(state, !kinetis_next_event(NULL, &event), "!kinetis_next_event(NULL, &event)");
    expect(state, !kinetis_next_event(device, NULL), "!kinetis_next_event(device, NULL)");
    uint8_t card_byte = 0u;
    expect(state, !kinetis_sdhc_read_card(NULL, 0u, &card_byte, sizeof(card_byte)),
           "SDHC card reads require a device");
}

#ifdef K22_TEST_ALLOCATION_FAILURE
static void test_allocation_failures(TestState* state) {
    KinetisConfiguration configuration = kinetis_default_configuration();
    configuration.profile = KINETIS_PROFILE_MK22FN1M012;
    configuration.package = KINETIS_PACKAGE_LQ_144_LQFP;
    configuration.flash_size = 4096u;
    configuration.sram_size = 65536u;
    uint32_t failure_count = 0u;
    uint32_t success_count = 0u;
    for (size_t allocation_index = 0u; allocation_index < 24u; allocation_index++) {
        test_fail_allocation_after(allocation_index);
        Kinetis* device = kinetis_create(configuration);
        test_allow_allocations();
        if (device == NULL) {
            failure_count++;
        } else {
            success_count++;
            kinetis_destroy(device);
        }
    }
    expect(state, failure_count >= 6u && success_count != 0u,
           "device construction handles each allocation boundary");

    Kinetis* device = kinetis_create(configuration);
    const uint8_t card_data[] = {1u, 2u, 3u, 4u};
    test_fail_allocation_after(0u);
    bool flexbus_attached = kinetis_flexbus_attach(device, 0u, card_data, sizeof(card_data), false);
    test_allow_allocations();
    expect(state, !flexbus_attached, "FlexBus attachment reports allocation failure");
    kinetis_destroy(device);
}
#endif

int main(void) {
    TestState state = {0};
    Kinetis* device = create_device(&state);
    test_data_api(&state, device);
    test_serial_api(&state, device);
    test_io_api(&state, device);
    test_guards(&state, device);
    kinetis_destroy(device);
    test_mkv30_package_and_channels(&state);
#ifdef K22_TEST_ALLOCATION_FAILURE
    test_allocation_failures(&state);
#endif
    return test_finish(&state);
}
